<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'internal_server_error' => 'সার্ভারে একটি ত্রুটি ঘটেছে। অনুগ্রহ করে পরে আবার চেষ্টা করুন',
    'otp_sent' => 'ভেরিফিকেশন কোড পাঠানো হয়েছে',
    'otp_resent' => 'ভেরিফিকেশন কোড পুনরায় পাঠানো হয়েছে',
    'otp_sending_blocked' => 'আপনার এই নম্বরটি ৫ মিনিটের জন্য ব্লক করা হয়েছে। অনুগ্রহ করে অপেক্ষা করুন',
    'user_inactive' => 'আপনার অ্যাকাউন্ট নিষ্ক্রিয় করা হয়েছে। অনুগ্রহ করে অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন',
    'user_deleted' => 'আপনার তথ্য মুছে ফেলা হয়েছে',


    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom messages.
    |
    */

    'custom' => [
        'configuration' => [
            'update' => [
                'basicInfo' => [
                    'success' => 'প্রতিষ্ঠানের মৌলিক তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের মৌলিক তথ্য আপডেট করা যায় নি'
                ],
                'additionalInfo' => [
                    'success' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য আপডেট করা যায় নি'
                ],
                'contactInfo' => [
                    'success' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য আপডেট করা যায় নি'
                ]
            ]
        ],

        'user' => [
            'store' => [
                'success' => 'নতুন ইউজার সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ইউজার তৈরি করা যায় নি'
            ],
            'update' => [
                'basic' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'profile' => [
                    'success' => 'ইউজারের প্রোফাইল আপডেট করা হয়েছে',
                    'error' => 'ইউজারের প্রোফাইল আপডেট করা যায় নি'
                ],
                'updateDetails' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'updateEmail' => [
                    'success' => 'ইউজারের ইমেইল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের ইমেইল আপডেট করা যায় নি'
                ],
                'updateMobileNumber' => [
                    'success' => 'ইউজারের মোবাইল নম্বর সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের মোবাইল নম্বর আপডেট করা যায় নি'
                ],
                'updateRoles' => [
                    'success' => 'ইউজারের রোল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের রোল আপডেট করা যায় নি'
                ],
                'updatePassword' => [
                    'success' => 'পাসওয়ার্ড সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'পাসওয়ার্ড আপডেট করা যায় নি'
                ]
            ],
            'destroy' => [
                'success' => 'ইউজারকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ইউজারকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ইউজারকে সক্রিয় করা হয়েছে',
                'deactivate' => 'ইউজারকে নিষ্ক্রিয় করা হয়েছে',
                'error' => 'ইউজারের স্ট্যাটাস পরিবর্তন করা যায় নি'
            ]
        ],

        'role' => [
            'store' => [
                'success' => 'নতুন রোল সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন রোল তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'রোল এবং পারমিশন সফলভাবে আপডেট করা হয়েছে',
                'error' => 'রোল এবং পারমিশন আপডেট করা যায় নি'
            ],
            'destroy' => [
                'basic' => [
                    'success' => 'রোল এবং পারমিশন সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'রোল এবং পারমিশন মুছে ফেলা যায় নি',
                ],
                'removeUserFromRole' => [
                    'success' => 'রোল থেকে ইউজারকে সফলভাবে সরানো হয়েছে',
                    'error' => 'রোল থেকে ইউজারকে মুছে ফেলা যায় নি'
                ]
            ],
            'changeStatus' => [
                'activate' => 'রোলটি সক্রিয় করা হয়েছে',
                'deactivate' => 'রোলটি নিষ্ক্রিয় করা হয়েছে',
                'error' => 'সুপার এডমিন এর স্ট্যাটাস পরিবর্তন করা যাবে না'
            ]
        ],

        'sms' => [
            'template' => [
                'store' => [
                    'success' => 'এসএমএস টেমপ্লেট সফলভাবে তৈরি হয়েছে',
                    'error' => 'এসএমএস টেমপ্লেট তৈরি করা যায়নি'
                ],
                'destroy' => [
                    'success' => 'এসএমএস টেমপ্লেট সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'এসএমএস টেমপ্লেট মুছে ফেলা যায়নি'
                ],
                'update' => [
                    'success' => 'এসএমএস টেমপ্লেট সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'এসএমএস টেমপ্লেট হালনাগাদ করা যায়নি'
                ],
                'changeStatus' => [
                    'activate' => 'এসএমএস টেমপ্লেট সক্রিয় করা হয়েছে',
                    'deactivate' => 'এসএমএস টেমপ্লেট নিষ্ক্রিয় করা হয়েছে',
                    'error' => 'এসএমএস টেমপ্লেটের স্ট্যাটাস পরিবর্তন করা যায়নি'
                ]
            ]
        ],

        'employeeManagement' => [
            'employee' => [
                'store' => [
                    'success' => 'নতুন কর্মচারী সফলভাবে তৈরি করা হয়েছে',
                    'error' => 'নতুন কর্মচারী তৈরি করা যায় নি'
                ],
                'destroy' => [
                    'success' => 'কর্মচারীকে সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'কর্মচারীকে মুছে ফেলা যায় নি'
                ],
                'update' => [
                    'basicInfo' => [
                        'success' => 'কর্মচারীর মৌলিক তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর মৌলিক তথ্য আপডেট করা যায় নি'
                    ],
                    'additionalInfo' => [
                        'success' => 'কর্মচারীর অতিরিক্ত তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর অতিরিক্ত তথ্য আপডেট করা যায় নি'
                    ],
                    'workInfo' => [
                        'success' => 'কর্মচারীর কাজের তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর কাজের তথ্য আপডেট করা যায় নি'
                    ],
                    'departureInfo' => [
                        'success' => 'কর্মচারী সফলভাবে চলে গেছেন',
                        'error' => 'কর্মচারী চলে যেতে পারেন নি'
                    ],
                    'rejoinInfo' => [
                        'success' => 'কর্মচারী সফলভাবে পুনরায় যোগদান করেছেন',
                        'error' => 'কর্মচারী যোগদান করতে পারেন নি'
                    ]
                ],
                'changeStatus' => [
                    'activate' => 'কর্মচারীকে সক্রিয় করা হয়েছে',
                    'deactivate' => 'কর্মচারীকে নিষ্ক্রিয় করা হয়েছে',
                    'error' => 'কর্মচারীর স্ট্যাটাস পরিবর্তন করা যায় নি'
                ]
            ]
        ],

        'jobPosition' => [
            'store' => [
                'success' => 'নতুন চাকুরীর পদ সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন চাকুরীর পদ তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'চাকুরীর পদ সফলভাবে আপডেট করা হয়েছে',
                'error' => 'চাকুরীর পদ আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'চাকুরীর পদটিকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'চাকুরীর পদটিকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'চাকুরীর পদটিকে সক্রিয় করা হয়েছে',
                'deactivate' => 'চাকুরীর পদটিকে নিষ্ক্রিয় করা হয়েছে',
                'error' => 'চাকুরীর পদের স্ট্যাটাস পরিবর্তন করা যায় নি'
            ]
        ],

        'department' => [
            'store' => [
                'success' => 'নতুন ডিপার্টমেন্ট সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ডিপার্টমেন্ট তৈরি করা যায়নি'
            ],
            'update' => [
                'success' => 'ডিপার্টমেন্টটি সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ডিপার্টমেন্টটি আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ডিপার্টমেন্টটি সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ডিপার্টমেন্টটি মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ডিপার্টমেন্টটি সক্রিয় করা হয়েছে',
                'deactivate' => 'ডিপার্টমেন্টটি নিষ্ক্রিয় করা হয়েছে'
            ]
        ],

        'subscription' => [
            'update' => [
                'success' => 'সাবস্ক্রিপশনটি সফলভাবে আপডেট করা হয়েছে',
                'error' => 'আপনার বর্তমান সাবস্ক্রিপশন প্ল্যান আর ব্যবহারযোগ্য নয়'
            ],
            'renew' => [
                'success' => 'সাবস্ক্রিপশনটি সফলভাবে রিনিউ করা হয়েছে',
                'error' => 'সাবস্ক্রিপশনটি রিনিউ করা যায় নি',
            ]
        ],

        'buyer' => [
            'store' => [
                'success' => 'নতুন ক্রেতা সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ক্রেতা তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'ক্রেতাকে সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ক্রেতাকে আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ক্রেতাকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ক্রেতাকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ক্রেতাকে সক্রিয় করা হয়েছে',
                'deactivate' => 'ক্রেতাকে নিষ্ক্রিয় করা হয়েছে',
                'error' => 'ক্রেতাকে স্ট্যাটাস পরিবর্তন করা যায় নি'
            ]
        ],

        'payment' => [
            'store' => [
                'success' => 'নতুন জমা সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন জমা যোগ করা যায় নি'
            ],
            'update' => [
                'success' => 'জমা সফলভাবে আপডেট করা হয়েছে',
                'error' => 'জমা আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'জমা সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'জমা মুছে ফেলা যায় নি'
            ]
        ],

        'sale' => [
            'store' => [
                'success' => 'নতুন বিক্রয় সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন বিক্রয় যোগ করা যায় নি'
            ],
            'update' => [
                'success' => 'বিক্রয় সফলভাবে আপডেট করা হয়েছে',
                'error' => 'বিক্রয় আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'বিক্রয় সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'বিক্রয় মুছে ফেলা যায় নি'
            ],
            'otherStore' => [
                'success' => 'অন্যান্য বিক্রয় সফলভাবে যোগ করা হয়েছে',
                'error' => 'অন্যান্য বিক্রয় যোগ করা যায় নি'
            ],
            'otherUpdate' => [
                'success' => 'অন্যান্য বিক্রয় সফলভাবে আপডেট করা হয়েছে',
                'error' => 'অন্যান্য বিক্রয় আপডেট করা যায় নি'
            ],
            'otherDestroy' => [
                'success' => 'অন্যান্য বিক্রয় সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'অন্যান্য বিক্রয় মুছে ফেলা যায় নি'
            ]
        ],

        'purchase' => [
            'store' => [
                'success' => 'নতুন ক্রয় সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন ক্রয় যোগ করা যায় নি'
            ],
            'update' => [
                'success' => 'ক্রয় সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ক্রয় আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ক্রয় সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ক্রয় মুছে ফেলা যায় নি'
            ],
            'otherStore' => [
                'success' => 'অন্যান্য নতুন ক্রয় সফলভাবে যোগ করা হয়েছে',
                'error' => 'অন্যান্য নতুন ক্রয় যোগ করা যায় নি'
            ],
            'otherUpdate' => [
                'success' => 'অন্যান্য ক্রয় সফলভাবে আপডেট করা হয়েছে',
                'error' => 'অন্যান্য ক্রয় আপডেট করা যায় নি'
            ],
            'otherDestroy' => [
                'success' => 'অন্যান্য ক্রয় সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'অন্যান্য ক্রয় মুছে ফেলা যায় নি'
            ]
        ],

        'brand' => [
            'store' => [
                'success' => 'নতুন ব্র্যান্ড সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন ব্র্যান্ড যোগ করা যায় নি'
            ],
            'update' => [
                'success' => 'ব্র্যান্ড সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ব্র্যান্ড আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ব্র্যান্ড সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ব্র্যান্ড মুছে ফেলা যায় নি'
            ]
        ],

        'expense' => [
            'store' => [
                'success' => 'নতুন খরচ সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন খরচ যোগ করা যায় নি'
            ],
        ],

        'fiscalYear' => [
            'store' => [
                'success' => 'অর্থবছর সফলভাবে তৈরি করা হয়েছে',
                'error' => 'অর্থবছর তৈরি করা যায়নি'
            ],
            'update' => [
                'success' => 'অর্থবছর সফলভাবে আপডেট করা হয়েছে',
                'error' => 'অর্থবছর আপডেট করা যায়নি'
            ],
            'changeStatus' => [
                'activate' => 'অর্থবছর সক্রিয় করা হয়েছে',
                'deactivate' => 'অর্থবছর নিষ্ক্রিয় করা হয়েছে',
                'error' => 'অর্থবছর স্ট্যাটাস পরিবর্তন করা যায় নি'
            ],
            'closeFiscalYear' => [
                'success' => 'অর্থবছর সফলভাবে বন্ধ করা হয়েছে',
                'error' => 'অর্থবছর বন্ধ করা যায়নি'
            ],
            'startFiscalYear' => [
                'success' => 'অর্থবছর সফলভাবে শুরু করা হয়েছে',
                'error' => 'অর্থবছর শুরু করা যায়নি'
            ]
        ],

        'auth' => [
            'sessionExpired' => 'সেশন মেয়াদোত্তীর্ণ হয়েছে। অনুগ্রহ করে পুনরায় লগইন করুন।',
            'userNotFound' => 'ইউজার খুঁজে পাওয়া যায়নি।',
            'otpExpired' => 'ওটিপির মেয়াদ শেষ। অনুগ্রহ করে আবার চেষ্টা করুন...',
            'otpInvalid' => 'ওটিপি সঠিক নয়। অনুগ্রহ করে আবার চেষ্টা করুন...'
        ]
    ]
];
