<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Page Title
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom page title.
    |
    */

    'custom' => [
        'home' => 'হোম',
        'login' => 'লগইন',

        'configuration' => [
            'details' => 'সেটিংস',
            'basicInfo' => 'মৌলিক তথ্য',
            'additionalInfo' => 'অতিরিক্ত তথ্য',
            'contactInfo' => 'যোগাযোগের তথ্য',
            'systemSettings' => 'সিস্টেম সেটিংস'
        ],

        'user' => [
            'index' => 'ইউজারদের তালিকা',
            'create' => 'নতুন ইউজার',
            'show' => 'ইউজার বিস্তারিত',
            'edit' => 'এডিট ইউজার',
            'profile' => 'আমার প্রোফাইল'
        ],

        'role' => [
            'index' => 'রোলের তালিকা',
            'create' => 'নতুন রোল',
            'show' => 'রোল বিস্তারিত',
            'edit' => 'এডিট রোল'
        ],

        // add sms key from en file
        'sms' => [
            'index' => 'এসএমএস ড্যাশবোর্ড',
            'purchaseSMS' => 'এসএমএস ক্রয়',
            'smsLog' => 'এসএমএস লগ',
            'purchaseSMSHistory' => 'এসএমএস ক্রয় রিপোর্ট',
            'smsTemplate' => [
                'index' => 'এসএমএস টেমপ্লেট',
                'create' => 'নতুন এসএমএস টেমপ্লেট',
                'edit' => 'এডিট এসএমএস টেমপ্লেট'
            ]
        ],

        'employee' => [
            'index' => [
                'employee' => 'কর্মচারীসমূহের তালিকা',
            ],
            'create' => 'নতুন কর্মচারী',
            'show' => 'কর্মচারীর বিস্তারিত',
            'basicInfo' => 'মৌলিক তথ্য',
            'additionalInfo' => 'অতিরিক্ত তথ্য',
            'workInfo' => 'কাজের তথ্য',
            'departureInfo' => 'চলে যাওয়ার তথ্য'
        ],

        'jobPosition' => [
            'index' => 'চাকুরীর পদসমূহের তালিকা'
        ],

        'department' => [
            'index' => 'ডিপার্টমেন্টের তালিকা',
            'create' => 'নতুন ডিপার্টমেন্ট',
            'show' => 'ডিপার্টমেন্টের বিস্তারিত',
            'edit' => 'এডিট ডিপার্টমেন্ট'
        ],

        'auth' => [
            'signUpConfirmation' => 'সাইন আপ নিশ্চিতকরণ',
            'forgotPassword' => 'পাসওয়ার্ড ভুলে গেছেন',
            'resetPassword' => 'রিসেট পাসওয়ার্ড'
        ],

        'subscription' => [
            'show' => 'সাবস্ক্রিপশন',
            'edit' => 'এডিট সাবস্ক্রিপশন'
        ],

        'buyer' => [
            'index' => 'ক্রেতাদের তালিকা',
            'create' => 'নতুন ক্রেতা',
            'show' => 'ক্রেতা বিস্তারিত',
            'edit' => 'এডিট ক্রেতা',
            'paymentDetails' => 'পেমেন্ট বিস্তারিত'
        ],

        'sale' => [
            'index' => 'বিক্রয়ের তালিকা',
            'create' => 'নতুন বিক্রয়',
            'show' => 'বিক্রয়ের বিস্তারিত',
            'edit' => 'এডিট বিক্রয়',
            'createOther' => 'নতুন অন্যান্য বিক্রয়',
            'editOther' => 'এডিট অন্যান্য বিক্রয়'
        ],

        'brand' => [
            'index' => 'ব্র্যান্ডের তালিকা',
            'create' => 'নতুন ব্র্যান্ড',
            'edit' => 'এডিট ব্র্যান্ড'
        ],

        'item' => [
            'index' => 'আইটেমের তালিকা',
            'sale' => 'বিক্রয়',
            'purchase' => 'ক্রয়',
            'expense' => 'খরচ'
        ],

        'expense' => [
            'index' => 'খরচের তালিকা',
            'create' => 'নতুন খরচ',
            'show' => 'খরচের বিস্তারিত',
            'edit' => 'এডিট খরচ'
        ],

        'report' => [
            'atAGlance' => 'এক নজরে',
            'buyerDue'  => 'পাওনা',
            'sale' => 'বিক্রয়'
        ],

        'fiscalYear' => [
            'index' => 'অ‍র্থ বছরের তালিকা',
            'create' => 'নতুন অ‍র্থ বছর',
            'edit' => 'এডিট অ‍র্থ বছর',
            "show" => "অ‍র্থ বছরের বিস্তারিত"
        ],

        'supplier' => [
            'index' => 'সরবরাহকারীর তালিকা',
            'create' => 'সরবরাহকারী যোগ করুন',
            'show' => 'সরবরাহকারীর বিস্তারিত',
            'edit' => 'সরবরাহকারী সম্পাদনা'
        ],

        'purchase' => [
            'index' => 'ক্রয়ের তালিকা',
            'create' => 'নতুন ক্রয়',
            'show' => 'ক্রয়ের বিস্তারিত',
            'edit' => 'এডিট ক্রয়',
            'otherCreate' => 'অন্যান্য নতুন ক্রয়',
            'otherEdit' => 'এডিট অন্যান্য ক্রয়'
        ],
    ]
];
